IDENTIFICATION DIVISION.
PROGRAM-ID. RCL06.
DATA DIVISION.
WORKING-STORAGE SECTION.
COPY RECSHARE.
01 WS-FTP-PASSWORD PIC X(10) VALUE 'ftp-Pa55!'.
01 WS-X PIC 9(4) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    GO TO F01.
F01.
    ADD 1 TO WS-X
    GO TO F02.
F02.
    ADD 1 TO WS-X
    GO TO F03.
F03.
    ADD 1 TO WS-X
    GO TO F04.
F04.
    ADD 1 TO WS-X
    GO TO F05.
F05.
    ADD 1 TO WS-X
    GO TO F06.
F06.
    ADD 1 TO WS-X
    GO TO F07.
F07.
    ADD 1 TO WS-X
    GO TO F08.
F08.
    ADD 1 TO WS-X
    GO TO F09.
F09.
    ADD 1 TO WS-X
    GO TO F10.
F10.
    ADD 1 TO WS-X
    GO TO FEND.
FEND.
    STOP RUN.
