000010 IDENTIFICATION DIVISION.
000020  PROGRAM-ID. FPTEST.
000030 DATA DIVISION.
000040 WORKING-STORAGE SECTION.
000050 01  WS-PASSWORD-OK-FLAG PIC X VALUE 'N'.
000060 01  WS-NAME             PIC X(10).
000070 01  WS-NAME-R REDEFINES WS-NAME.
000080     05 WS-FIRST         PIC X(5).
000090     05 WS-LAST          PIC X(5).
000100 01  WS-MSG              PIC X(40).
000110      COPY DFHAID.
000120      EXEC SQL INCLUDE SQLCA END-EXEC.
000130 PROCEDURE DIVISION.
000140 MAIN-PARA.
000150      MOVE 'N' TO WS-PASSWORD-OK-FLAG
000160      MOVE 'Y' TO WS-PASSWORD-OK-FLAG
000170      DISPLAY 'PLEASE DO NOT GO TO THE OFFICE'
000180      MOVE 'GO TO MENU' TO WS-MSG
000190      EXEC SQL CONNECT TO DB2P USER 'DB' USING 'Pa55w0rd' END-EXEC
000200      ACCEPT WS-NAME FROM CONSOLE
000210      STOP RUN.
