000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. FSUNCHK.
000030 ENVIRONMENT DIVISION.
000040 INPUT-OUTPUT SECTION.
000050 FILE-CONTROL.
000060     SELECT IN-FILE ASSIGN TO INDD
000070         FILE STATUS IS WS-IN-FS.
000080     SELECT OUT-FILE ASSIGN TO OUTDD
000090         FILE STATUS IS WS-OUT-FS.
000100 DATA DIVISION.
000110 FILE SECTION.
000120 FD  IN-FILE.
000130 01  IN-REC               PIC X(80).
000140 FD  OUT-FILE.
000150 01  OUT-REC              PIC X(80).
000160 WORKING-STORAGE SECTION.
000170 01  WS-IN-FS             PIC XX.
000180 01  WS-OUT-FS            PIC XX.
000190     88 OUT-OK            VALUE '00'.
000200 PROCEDURE DIVISION.
000210 MAIN-PARA.
000220     OPEN INPUT IN-FILE
000230     OPEN OUTPUT OUT-FILE
000240     IF NOT OUT-OK
000250        DISPLAY 'OPEN FAILED'
000260        STOP RUN
000270     END-IF
000280     READ IN-FILE
000290     MOVE IN-REC TO OUT-REC
000300     WRITE OUT-REC
000310     CLOSE IN-FILE OUT-FILE
000320     STOP RUN.
